Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.CanBeHookNormal(System.Int32,System.Int32,Autodesk.Revit.DB.XYZ)
A vector can be termination's (e.g. hook, crank) normal if for a bar specified by index, the bar direction is not parallel with the vector.
barIndex:
The index of bar for which it will try to see if termination's plane normal is applicable.
end:
The end of bar. Should be 0 for start, 1 for end.
normal:
The teriantion's (e.g. hook, crank) plane normal that will be tested.
Returns:
A vector can be termination's (e.g. hook, crank) normal if for a bar specified by index, the bar direction is not parallel with the vector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barIndex is not in the range [ 0, NumberOfBarPositions-1 ].
-or-
Invalid end.
Since:
2018

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.GetHookOrientationAngle(System.Int32)
Get the termination's rotation angle at end.
The angle is used for both hook and crank.
end:
The end of bar. Should be 0 for start or 1 for end.
Returns:
The termination's rotation angle at end.
The angle is used for both hook and crank.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Invalid end.
Since:
2018

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.SetHookOrientationAngle(System.Int32,System.Double)
Set the termination's rotation angle at end.
The angle will be used for both hook and crank.
Will throw exception if the rebar has valid constraints.
end:
The end of bar. Should be 0 for start or 1 for end.
angle:
The termination's rotation angle at end.
The angle will be used for both hook and crank.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for angle is not finite
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Invalid end.
Since:
2018

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.GetHookPlaneNormalForBarIdx(System.Int32,System.Int32)
Returns the plane's normal in which the termination (e.g. hook, crank) at end of bar with index barPositionIndex will stay.
The plane's normal is used for both hook and crank.
end:
The end of bar. Should be 0 for start or 1 for end.
barPositionIndex:
An index between 0 and (NumberOfBarPositions-1).
Returns:
The plane's normal in which the termination (e.g. hook, crank) at end of bar with index barPositionIndex will stay.
The plane's normal is used for both hook and crank.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
-or-
Invalid end.
Since:
2018

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.SetHookPlaneNormalForBarIdx(System.Int32,System.Int32,Autodesk.Revit.DB.XYZ)
Set the plane's normal in which the termination at end of bar with index barPositionIndex will stay.
The plane's normal will be used for both hook and crank.
Will throw exception if the rebar has valid constraints.
end:
The end of bar. Should be 0 for start or 1 for end.
barPositionIndex:
An index between 0 and (NumberOfBarPositions-1).
terminationPlaneNormal:
The plane's in which the termination at end of bar with index barPositionIndex will stay.
The plane's normal will be used for both hook and crank.
The normal should be perpendicular to the bar direction at the specified end of bar.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Normal terminationPlaneNormal for end end isn't a valid normal for bar with index barPositionIndex
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
-or-
Invalid end.
-or-
terminationPlaneNormal has zero length.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarFreeFormAccessor Rebar is constrained.
Since:
2018

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.GetHookOrientationAtIndex(System.Int32,System.Int32)
Gets the termination's orientation that is applied to this Rebar at the bar with index barPositionIndex at the specified end.
The orientation it's the same for both hook and crank.
Remarks:
If this Rebar has Workshop Instructions set to Straight will return the same value for all barPositionIndex between 0 and (NumberOfBarPositions-1). This value will be the same as Rebar.GetHookOrientation(int end).
If this Rebar has Workshop Instructions set to Bent there are different cases:
All bars are matched exactly with a shape. In this case will return the same value for all barPositionIndex between 0 and (NumberOfBarPositions-1). This value will be the same as Rebar.GetHookOrientation(int end).All bars are matched in reversed order with a shape. In this case will return the same value for all barPositionIndex between 0 and (NumberOfBarPositions-1). This value will be the same as Rebar.GetHookOrientation(int end).Some bars are matched in reversed order and the others are matched exactly with a shape. In this case for bars that are matched reversed will return the hook orientation at the opposite end. For the others bars will return the same as Rebar.GetHookOrientation(int end).
barPositionIndex:
An index between 0 and (NumberOfBarPositions-1).
end:
0 for the start hook, 1 for the end hook.
Returns:
Returns the hook orientation at the specified end.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
-or-
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
Since:
2019

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.GetHookOrientationAngleAtIndex(System.Int32,System.Int32)
Gets the termnination's rotation angle that is applied to this Rebar at the bar with index barPositionIndex at the specified end.
The rotation angle it's the same for both hook and crank.
Remarks:
If this Rebar has Workshop Instructions set to Straight will return the same value for all barPositionIndex between 0 and (NumberOfBarPositions-1). This value will be the same as Rebar.GetTerminationRotationAngle(int end).
If this Rebar has Workshop Instructions set to Bent there are different cases:
All bars are matched exactly with a shape. In this case will return the same value for all barPositionIndex between 0 and (NumberOfBarPositions-1). This value will be the same as Rebar.GetTerminationRotationAngle(int end).All bars are matched in reversed order with a shape. In this case will return the same value for all barPositionIndex between 0 and (NumberOfBarPositions-1). This value will be the same as Rebar.GetTerminationRotationAngle(int end).Some bars are matched in reversed order and the others are matched exactly with a shape. In this case for bars that are matched reversed will return the rotation angle at the opposite end. For the others bars will return the same as Rebar.GetTerminationRotationAngle(int end).
barPositionIndex:
An index between 0 and (NumberOfBarPositions-1).
end:
0 for the start of the bar, 1 for the end of the bar.
Returns:
Returns the termination's rotation angle at the specified end.
The rotation angle it's the same for both hook and crank.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
-or-
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
Since:
2019